[M_Orchid_Grendel MissionDefinition]
MissionDescription="Scary hidden creatures [place]It's weird[-place]. Lord Hammerlock, a zoologist and hunter, is tasked with finding and killing the creature.."
TurnInDescription="You kill animals [place]He hates stupidity[-place] Now you are safe! Besides all the bandits and crystals, he didn't kill any other creatures.."
MissionSummary="Find and kill ghosts."
